In [ ]:
#object data type converting

In [13]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [14]:
data={
    'City':['NewYork','lose Angels','chicago','Newyork','chicago'],
    'Education':['Bachlor','Master','PhD','Master','Bachler']
}

In [15]:
df=pd.DataFrame(data)
df

          City Education
0      NewYork   Bachlor
1  lose Angels    Master
2      chicago       PhD
3      Newyork    Master
4      chicago   Bachler

In [16]:
encoder=OneHotEncoder(sparse_output=False)

In [17]:
encode_df=encoder.fit_transform(df[['City','Education']])

In [19]:
encodedf=pd.DataFrame(encode_df,columns=encoder.get_feature_names_out(['City','Education']))
encodedf

,City_NewYork,City_Newyork,City_chicago,City_lose Angels,Education_Bachler,Education_Bachlor,Education_Master,Education_PhD
0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0
2,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0
3,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0
4,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0